Revit 2027 API
ParameterTypeId.ViewSolarstudyIsLightingStudyType Property
 "Lighting study"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ViewSolarstudyIsLightingStudyType { get; }
Public Shared ReadOnly Property ViewSolarstudyIsLightingStudyType As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ViewSolarstudyIsLightingStudyType {
	ForgeTypeId^ get ();
}
static member ViewSolarstudyIsLightingStudyType : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace